tsung/warm_up.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.6.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" dumptraffic="true" version="1.0">
    <!-- Client side setup -->
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="15000" />
    </clients>
    <!-- Server side setup -->
    <servers>
        <server host="bidding-system-priyankabose.c9users.io" port="443" type="ssl"></server>
    </servers>
    <load>
      <arrivalphase phase="1" duration="20" unit="second">
          <users arrivalrate="10" unit="second"></users>
      </arrivalphase>

      <arrivalphase phase="2" duration="20" unit="second">
          <users arrivalrate="20" unit="second"></users>
      </arrivalphase>

      <arrivalphase phase="3" duration="20" unit="second">
          <users arrivalrate="30" unit="second"></users>
      </arrivalphase>

    </load>
    
    <options>
        <option name="global_ack_timeout" value="20000"></option>
        <option type="ts_http" name="user_agent">
            <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
        </option>
    </options>
    
    <sessions>

      <session name="seller-sellproduct" probability="100" type="ts_http"> 

        <transaction name="login">

          <request>
            <dyn_variable name="authenticity_token"></dyn_variable>
            <http url="/users/sign_in" version='1.1' method='GET'></http>
          </request>

          <thinktime value="2" random="true"></thinktime>

          <setdynvars sourcetype="eval" code="fun({Pid,DynVars})-&gt;{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
            <var name="authenticity_token" />
          </setdynvars>

          <setdynvars sourcetype="random_number" start="1" end="10000">
            <var name="random_email_number" />
          </setdynvars>

          <request subst="true">
            <http url="/users/sign_in" method="POST" version="1.1"
            contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=user%%_random_email_number%%@bid.com&amp;user%5Bpassword%5D=password&amp;user%5Bremember_me%5D=0"></http>
          </request>

        </transaction>

        <thinktime value="2" random="true"></thinktime>

        <transaction name="show_edit">
          
          <request>
            <http url="/products/my_products" version="1.1" method="GET"></http>
          </request>

          <request subst="true">
            <dyn_variable name="show_url" xpath="//table/tbody/tr[last()]/td[6]/a/@href" ></dyn_variable>
            <http url="/products/my_products" version="1.1" method="GET"></http>
          </request>

          <request subst="true">
            <http url= "%%_show_url%%" version="1.1" method="GET"></http>
          </request>

          <thinktime value="2" random="true"></thinktime>

          <request subst="true">
            <dyn_variable name="edit_url" xpath="//table/tbody/tr[last()]/td[7]/a/@href" ></dyn_variable>
            <http url="/products/my_products" version="1.1" method="GET"></http>
          </request>

          <request subst="true">
            <dyn_variable name="authenticity_token" xpath="//meta[@name='csrf-token']/@content"></dyn_variable>
            <http url= "%%_edit_url%%" version="1.1" method="GET"></http>
          </request>

        </transaction>

        <thinktime value="2" random="true"></thinktime>

        <transaction name="start_bid">

          <request subst="true">
            <dyn_variable name="bid_url" xpath="//table/tbody/tr[last()]/td[9]/a/@href"></dyn_variable>
            <dyn_variable name="bid_name" xpath="//table/tbody/tr[last()]/td[9]/a/text()"></dyn_variable>
            <http url="/products/my_products" version="1.1" method="GET"></http>
          </request>

          <request subst="true">
            <dyn_variable name="authenticity_token"></dyn_variable>
            <dyn_variable name="product_id" xpath="//input[@name='products_under_bid[product_id]']/@value"></dyn_variable>
            <http url= "%%_bid_url%%" version="1.1" method="GET"></http>
          </request>

        </transaction>

        <thinktime value="2" random="true"></thinktime>

        <transaction name="log_out">
          
          <request>
            <dyn_variable name="authenticity_token" xpath="//meta[@name='csrf-token']/@content"></dyn_variable>
            <http url="/products/my_products" version="1.1" method="GET"></http>
          </request>

          <setdynvars sourcetype="eval" code="fun({Pid,DynVars})-&gt;{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
              <var name="authenticity_token" />
          </setdynvars>

          <request subst="true">
            <http url="/users/sign_out" version="1.1" method="DELETE" contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%"></http>
          </request>
          
        </transaction>
      </session>
    </sessions>
</tsung>